{"pageProps":{"postData":{"id":"sql-log-analyzer","contentHtml":"<p>This is a standalone web app that parses the SQL queries from the log and categorises them by tables and query types.</p>\n<h2>Motivation</h2>\n<p>While I was working in Freshworks, during feature development, I was expected to optimize each and every query that was fired as part of the feature. And many times the existing queries had to be optimized to have better response times.</p>\n<p>In local development, it was very tiresome to look through the Rails server logs to find out the join queries, unexpected table's queries and unwanted load queries. In order to get a holistic and organised view of the queries from the Rails server logs, I wrote this tiny standalone app using angular.</p>\n<h2>Development</h2>\n<p>Learning Angular was one of the objectives of this hobby project. I experimented with angular for the first time while developing this (2014). I used the most primitive version of Angular for this. At that point in time, my style of learning things was to just get into it and do it. If you don't know something, search for it, learn it and do it.</p>\n<p>The first plan of action for this to work was to find the SQL queries from the log. The second step was to parse the queries and categorise them by tables and query types. Fortunately enough, I found a javascript library called <code>simpleSqlParser</code> which does this. With that library and a UI powered by Angular, I created a V1 version of this.</p>\n<p>Recently when I was going through this, I decided to use tailwind for CSS. The first version had a bunch of handwritten CSS styles and HTML packed with some Angular controllers. If you go through the older commits from 2014-15, you will see this.</p>\n<h2>Working</h2>\n<p>This web app does not require a backend and can run in any browser. This app is used to categorise the queries by tables and by type from the log. (If you are running a Rails server, you can directly copy-paste the server logs as it will have the SQL queries.)</p>\n<p>To get this working, follow the following steps:</p>\n<ol>\n<li>You have two options to get hands-on with this.\n<ol>\n<li>You can visit the <a href=\"https://sony-mathew.com/sql-log-analyzer/\" target=\"_blank\" rel=\"nofollow\">live demo page</a></li>\n<li>Or set this up in local environment by\n<ol>\n<li>Cloning the repo using the following command : <code>git clone git@github.com:sony-mathew/sql-log-analyzer.git</code></li>\n<li>and going to the cloned repo directory and open the <code>index.html</code> file in your browser.</li>\n</ol>\n</li>\n</ol>\n</li>\n<li>The first page will have a plain text box to input the log. Copy and paste the server log in the text box. Click on Submit button.\n<img src=\"/images/posts/sql-log-analyzer/input.png\" /></li>\n<li>Voila. Now you will be shown a page where you can select the table. Now select a table from the dropdown.</li>\n<li>After selecting the table you can select the type of query related to that table.\n<img src=\"/images/posts/sql-log-analyzer/table_select.png\" /></li>\n<li>As soon as you select the query type, all the queries of that type related to that table you selected will be listed below.</li>\n</ol>\n<h2>Optimizing Queries</h2>\n<p>With this, you have the list of tables and types of queries (<code>JOINS</code>, <code>GROUP BY</code>, <code>WHERE</code> conditions). Now the question is how do you take action on this.</p>\n<p>I primarily worked with MySQL and Postgres. What I did with the above info was to find some suspicious queries (which had <code>JOINS</code>, <code>WHERE</code>, <code>ORDER BY</code> or <code>GROUP BY</code>). Once I isolated the queries which I think was non-performant, I used <code>EXPLAIN</code> on those queries. The <code>EXPLAIN</code> statement is used to obtain a query execution plan (that is, an explanation of how MySQL or Postgres would execute a query).</p>\n<p>For example, consider the following query.</p>\n<pre><code class=\"language-sql\">SELECT \"titles\".\"tconst\", \"originalTitle\", \"crew\".\"directors\" FROM \"titles\" INNER JOIN \"crew\" ON \"titles\".\"tconst\"=\"crew\".\"tconst\";\n</code></pre>\n<p>This is the output for this query in the console.</p>\n<img src=\"/images/posts/sql-log-analyzer/sql-select-query.png\" />\n<p>When you do <code>EXPLAIN</code> on this query</p>\n<pre><code class=\"language-sql\">EXPLAIN SELECT \"titles\".\"tconst\", \"originalTitle\", \"crew\".\"directors\" FROM \"titles\" INNER JOIN \"crew\" ON \"titles\".\"tconst\"=\"crew\".\"tconst\";\n</code></pre>\n<p>you will get the following output</p>\n<pre><code class=\"language-sql\">Hash Join  (cost=269460.21..750552.93 rows=7328951 width=38)\n  Hash Cond: (titles.tconst = crew.tconst)\n  ->  Seq Scan on titles  (cost=0.00..182196.51 rows=7328951 width=30)\n  ->  Hash  (cost=134872.76..134872.76 rows=7330676 width=18)\n        ->  Seq Scan on crew  (cost=0.00..134872.76 rows=7330676 width=18)\n</code></pre>\n<img src=\"/images/posts/sql-log-analyzer/sql-explain-query.png\" />\n<p>With this query plan, you can identify sequential scans performed. If there is an <code>ORDER BY</code> clause, you might see <code>Using temporary; Using filesort;</code> in the query plan. This will give an idea on which parts of the query is making it slow. Now it's up to you to take action on the slow parts of the query.</p>\n<p>To fine-tune a query you have to go deeper and understand how each of the parts works. If you know how MySQL executes <code>ORDER BY</code>, you will do certain things to optimize that when you have an <code>ORDER BY</code> in your SQL query. This is not an everyday scenario in smaller companies. This becomes relevant when you are at scale and avoiding the bottlenecks, optimizing the system and resources for maximum performance and output.</p>\n<p>Bonus reading on <a href=\"http://s.petrunia.net/blog/?p=24\" target=\"_blank\" rel=\"nofollow\">How MySQL executes ORDER BY</a>.</p>\n<h2>Special Mention</h2>\n<p>I have used a third party javascript library for parsing the SQL Queries.\nThis libary is called <a href=\"https://github.com/dsferruzza/simpleSqlParser\" target=\"_blank\" rel=\"nofollow\">simpleSqlParser</a> and it's an awesome library, without which it would have been very difficult.</p>\n<h2>Links</h2>\n<p><a href=\"https://sony-mathew.com/sql-log-analyzer/\" target=\"_blank\" rel=\"nofollow\">Live Demo</a></p>\n<p><a href=\"https://github.com/sony-mathew/sql-log-analyzer/\" target=\"_blank\" rel=\"nofollow\">Github</a></p>\n","title":"Standalone SQL Log Analyser","description":"A standalone web app that parses the SQL queries from the log and categorises them by tables and query types.","date":"2020-11-12","author":"Sony Mathew","readingTime":7,"categories":["Technology"],"tags":["sql","analyzer","performance","log","parser"]}},"__N_SSG":true}