{"pageProps":{"postData":{"id":"building-personal-blog-using-nextjs-and-github-pages","contentHtml":"<h2 id=\"the-beginning\">The Beginning</h2>\n<p>The idea of having a personal website was certainly an old one, from the time I started spending time on the internet and social media. During my college days, I used to do gigs in Fiverr pretending to be a hardcore <a href=\"https://wordpress.com/\" target=\"_blank\" rel=\"nofollow\">WordPress</a> Developer. Even though I was not at the time, I learned it while doing the gigs. I fully embraced the ideology, fake it till you make it. After learning PHP and having some experience with developing a handful of websites as a freelancer, <a href=\"https://wordpress.com/\" target=\"_blank\" rel=\"nofollow\">WordPress</a> became a favorite.</p>\n<p>With this familiarity bias, my first option for a personal blog was a free account in <a href=\"https://wordpress.com/\" target=\"_blank\" rel=\"nofollow\">WordPress</a>. So I did that, long back in 2011 itself. But as soon as created that, I lost interest, I got busy with college, activities, then job, and then totally forgot about this.</p>\n<h2 id=\"world-of-ruby\">World of Ruby</h2>\n<p>Then in 2014, I joined Freshworks (then Freshdesk) right out of college and learned this amazing technology called Ruby on Rails. Man, I was high on that for so long. <a href=\"https://www.ruby-lang.org/en/\" target=\"_blank\" rel=\"nofollow\">Ruby</a> is an open-source programming language with a focus on simplicity and productivity. It has an elegant syntax that is natural to read and easy to write. The clarity of expressing things in Ruby is unparalleled. <a href=\"https://rubyonrails.org/\" target=\"_blank\" rel=\"nofollow\">Ruby on Rails</a> is a framework that sprinkles magic on top of already magical Ruby. So far from what I have heard and read, the only programming language that is associated with the word <code>Magic</code> so far is Ruby.</p>\n<p>As a junior professional Ruby developer, I decided to create a blog in Ruby on Rails. I went crazy on features. Added this and that and then some more. But it was taking a lot of time and I never felt it was ready for production. So at some point, I lost interest and left it.</p>\n<h2 id=\"mediumcom\">Medium.com</h2>\n<p>During that time <a href=\"https://medium.com/\" target=\"_blank\" rel=\"nofollow\">Medium</a> became popular and most of the people in my circle started writing there. I caved in on <a href=\"https://medium.com/\" target=\"_blank\" rel=\"nofollow\"><code>Medium</code></a> wave and gave the idea of the self-hosted blog a rest. I started writing there. I must admit, it was a breeze to write and publish there.</p>\n<p>Being a semi-power-user/developer, it did not feel at home. I wanted to change this and that and would have loved to have some JavaScript executed. It's not that I will write JavaScript-related content and requires embedded JavaScript to be executed, it's the idea of freedom to do what you wanted to do if and when you want to do that was powerful. It did not matter whether you will do it or not. I think it resonates at some levels with the current Covid situation. Even though many of us are not avid travelers or go out for fine dining every day or meet friends every day, it's the thought that we could not do it even if wanted that matters.</p>\n<h2 id=\"middleman-and-jekyll\">Middleman and Jekyll</h2>\n<p>At some point, this idea popped up again and gained some time of my thoughts. I was back to the original drawing board. This time I decided it to be as minimal as possible. I wanted to run this with minimal maintenance costs in regards to time and money. I took a couple of decisions, in terms of technology, distribution, setup, and hosting.</p>\n<ol>\n<li>I wanted to have something that I have full control of. I decided to have the codebase in GitHub.</li>\n<li>The best way to have a minimalist setup is to have a static website. I decided to use a  static website builder.</li>\n<li>One of the requirements that I ranked higher was that, after the initial setup, I should be able to write and publish new blog posts relatively easy.</li>\n<li>I was a fan of GitHub Pages. Decided to use this for hosting.</li>\n</ol>\n<p>Even though I had matured in my view of programming languages in general, the one I knew well and had a little crush on was still Ruby. So decided to use a tool called the <a href=\"https://middlemanapp.com/\" target=\"_blank\" rel=\"nofollow\">Middleman App</a>. This is used to build static websites with Ruby. With this, after the initial setup, you could just write a new YML file for a new blog and build it to get the static website.</p>\n<p>I started building it and I lost interest while doing the customizations. Scraped whatever I did with Middleman and decided to use yet another Ruby static website builder called <a href=\"https://jekyllrb.com/\" target=\"_blank\" rel=\"nofollow\">Jekyll</a>. Once again, started building. Felt the adrenaline rush. But that too died soon. I did the basic setup with both and the excitement died when I reached the theming and customization stage. After this short stint, the idea was put to rest for the time being.</p>\n<h2 id=\"covid-and-the-digital-creativity\">Covid and the digital creativity</h2>\n<p>Then the little viruses started attacking the world. The whole world was turned upside down. It was turmoil everywhere. We lost the physical touch with the outside world. Initial days of lockdown and covid were filled with uncertainties and meaning of life kinda thoughts. At some point, some of this subsided and the wonderful people everywhere started pursuing their hobbies. I could see a lot of content creators on almost every social platform that I roamed. The world started to run in different directions.</p>\n<p>During all this time I felt that there are things that I learned that I could share with the world which might be useful for someone who walks a similar path at some point in time. This was a constant thought at the back of my mind, but I felt reluctant to write on other platforms since this idea of a self-hosted blog was kind of a blocker whenever I thought about writing. I jotted down ideas and writing points in a note-taking app and moved on whenever the writing urge struck.</p>\n<h2 id=\"nextjs-tailwind-css-and-github-pages\">Next.js, Tailwind CSS and GitHub Pages</h2>\n<p>With the inspiration drawn from this wave of digital content making, I went back to the idea of a self-hosted blog again. This time, a couple of decisions had changed. I had a glimpse of <a href=\"https://nextjs.org/\" target=\"_blank\" rel=\"nofollow\">Next.js</a> and <a href=\"https://tailwindcss.com/\" target=\"_blank\" rel=\"nofollow\">Tailwind CSS</a>. The initial impression about both of them was just WOW. Decided to try out building the blog with this.</p>\n<p>I was afraid that after all the previous failed attempts, I might lose interest on the way and will abandon it. Anyways as you know and as you reading this, that did not happen. Just read through the <a href=\"https://nextjs.org/\" target=\"_blank\" rel=\"nofollow\">Next.js</a> documentation and tried out <a href=\"https://tailwindcss.com/\" target=\"_blank\" rel=\"nofollow\">Tailwind CSS</a> in a couple of hours. Was able to get to a decent shape in a day. Added few customizations over a couple of days and felt proud. I used <a href=\"https://pages.github.com/\" target=\"_blank\" rel=\"nofollow\">GitHub Pages</a> to host <a href=\"https://sony-mathew.github.io\" target=\"_blank\" rel=\"nofollow\">this</a> as it was free and works out of the box with the repo in GitHub. I still did not fully feel that this was production-ready (rightly so, as every developer feels 99% of the time about anything that they build). Somehow, the thought of starting small and building one step at a time overpowered the former. So I bought a domain and put it out there.</p>\n<img src=\"/images/posts/building-personal-blog-using-nextjs-and-github-pages/sony-mathew-com.png\" />\n<p>You can checkout the codebase here: <a href=\"https://github.com/sony-mathew/sony-mathew.github.io\" target=\"_blank\" rel=\"nofollow\">https://github.com/sony-mathew/sony-mathew.github.io</a></p>\n<p>Anybody can clone this codebase and make changes to host a personal blog of your own. I will be writing a follow-up article on how to do this.</p>\n<p>I urge you to share what you are have learned. This will one day help someone. I assure you something that you think is so simple might be alien to someone else.</p>\n","content":"\n## The Beginning\n\nThe idea of having a personal website was certainly an old one, from the time I started spending time on the internet and social media. During my college days, I used to do gigs in Fiverr pretending to be a hardcore [WordPress](https://wordpress.com/) Developer. Even though I was not at the time, I learned it while doing the gigs. I fully embraced the ideology, fake it till you make it. After learning PHP and having some experience with developing a handful of websites as a freelancer, [WordPress](https://wordpress.com/) became a favorite.\n\nWith this familiarity bias, my first option for a personal blog was a free account in [WordPress](https://wordpress.com/). So I did that, long back in 2011 itself. But as soon as created that, I lost interest, I got busy with college, activities, then job, and then totally forgot about this.\n\n## World of Ruby\n\nThen in 2014, I joined Freshworks (then Freshdesk) right out of college and learned this amazing technology called Ruby on Rails. Man, I was high on that for so long. [Ruby](https://www.ruby-lang.org/en/) is an open-source programming language with a focus on simplicity and productivity. It has an elegant syntax that is natural to read and easy to write. The clarity of expressing things in Ruby is unparalleled. [Ruby on Rails](https://rubyonrails.org/) is a framework that sprinkles magic on top of already magical Ruby. So far from what I have heard and read, the only programming language that is associated with the word `Magic` so far is Ruby.\n\nAs a junior professional Ruby developer, I decided to create a blog in Ruby on Rails. I went crazy on features. Added this and that and then some more. But it was taking a lot of time and I never felt it was ready for production. So at some point, I lost interest and left it.\n\n## Medium.com\n\nDuring that time [Medium](https://medium.com/) became popular and most of the people in my circle started writing there. I caved in on [`Medium`](https://medium.com/) wave and gave the idea of the self-hosted blog a rest. I started writing there. I must admit, it was a breeze to write and publish there.\n\nBeing a semi-power-user/developer, it did not feel at home. I wanted to change this and that and would have loved to have some JavaScript executed. It's not that I will write JavaScript-related content and requires embedded JavaScript to be executed, it's the idea of freedom to do what you wanted to do if and when you want to do that was powerful. It did not matter whether you will do it or not. I think it resonates at some levels with the current Covid situation. Even though many of us are not avid travelers or go out for fine dining every day or meet friends every day, it's the thought that we could not do it even if wanted that matters.\n\n## Middleman and Jekyll\n\nAt some point, this idea popped up again and gained some time of my thoughts. I was back to the original drawing board. This time I decided it to be as minimal as possible. I wanted to run this with minimal maintenance costs in regards to time and money. I took a couple of decisions, in terms of technology, distribution, setup, and hosting.\n1. I wanted to have something that I have full control of. I decided to have the codebase in GitHub.\n2. The best way to have a minimalist setup is to have a static website. I decided to use a  static website builder.\n3. One of the requirements that I ranked higher was that, after the initial setup, I should be able to write and publish new blog posts relatively easy.\n4. I was a fan of GitHub Pages. Decided to use this for hosting.\n\nEven though I had matured in my view of programming languages in general, the one I knew well and had a little crush on was still Ruby. So decided to use a tool called the [Middleman App](https://middlemanapp.com/). This is used to build static websites with Ruby. With this, after the initial setup, you could just write a new YML file for a new blog and build it to get the static website.\n\nI started building it and I lost interest while doing the customizations. Scraped whatever I did with Middleman and decided to use yet another Ruby static website builder called [Jekyll](https://jekyllrb.com/). Once again, started building. Felt the adrenaline rush. But that too died soon. I did the basic setup with both and the excitement died when I reached the theming and customization stage. After this short stint, the idea was put to rest for the time being. \n\n## Covid and the digital creativity\n\nThen the little viruses started attacking the world. The whole world was turned upside down. It was turmoil everywhere. We lost the physical touch with the outside world. Initial days of lockdown and covid were filled with uncertainties and meaning of life kinda thoughts. At some point, some of this subsided and the wonderful people everywhere started pursuing their hobbies. I could see a lot of content creators on almost every social platform that I roamed. The world started to run in different directions. \n\nDuring all this time I felt that there are things that I learned that I could share with the world which might be useful for someone who walks a similar path at some point in time. This was a constant thought at the back of my mind, but I felt reluctant to write on other platforms since this idea of a self-hosted blog was kind of a blocker whenever I thought about writing. I jotted down ideas and writing points in a note-taking app and moved on whenever the writing urge struck.\n\n## Next.js, Tailwind CSS and GitHub Pages\n\nWith the inspiration drawn from this wave of digital content making, I went back to the idea of a self-hosted blog again. This time, a couple of decisions had changed. I had a glimpse of [Next.js](https://nextjs.org/) and [Tailwind CSS](https://tailwindcss.com/). The initial impression about both of them was just WOW. Decided to try out building the blog with this.\n\nI was afraid that after all the previous failed attempts, I might lose interest on the way and will abandon it. Anyways as you know and as you reading this, that did not happen. Just read through the [Next.js](https://nextjs.org/) documentation and tried out [Tailwind CSS](https://tailwindcss.com/) in a couple of hours. Was able to get to a decent shape in a day. Added few customizations over a couple of days and felt proud. I used [GitHub Pages](https://pages.github.com/) to host [this](https://sony-mathew.github.io) as it was free and works out of the box with the repo in GitHub. I still did not fully feel that this was production-ready (rightly so, as every developer feels 99% of the time about anything that they build). Somehow, the thought of starting small and building one step at a time overpowered the former. So I bought a domain and put it out there.\n\n<img src=\"/images/posts/building-personal-blog-using-nextjs-and-github-pages/sony-mathew-com.png\" />\n\nYou can checkout the codebase here: [https://github.com/sony-mathew/sony-mathew.github.io](https://github.com/sony-mathew/sony-mathew.github.io)\n\nAnybody can clone this codebase and make changes to host a personal blog of your own. I will be writing a follow-up article on how to do this.\n\nI urge you to share what you are have learned. This will one day help someone. I assure you something that you think is so simple might be alien to someone else.\n","title":"Building a Personal Blog with Next.js and Github Pages","description":"The story of a personal blog developed using Next.js, Tailwind CSS and hosted freely using GitHub Pages.","date":"2021-07-25","author":"Sony Mathew","readingTime":8,"categories":["Development"],"tags":["software development","nextjs","github pages","blog"],"toc":true}},"__N_SSG":true}